app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.build(tweet_id: params[:tweet_id])
    favorite.save
---
INSERT INTO "favorites" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["tweet_id", 3], ["created_at", "2020-11-30 13:23:17.740848"], ["updated_at", "2020-11-30 13:23:17.740848"]]