app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user_id = current_user.id
    @tweet.save
---
INSERT INTO "tweets" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2020-11-30 08:29:14.097550"], ["updated_at", "2020-11-30 08:29:14.097550"]]